bench/traefik.log
sysbench 1.0.20 (using system LuaJIT 2.0.5)

Running the test with following options:
Number of threads: 3
Report intermediate results every 5 second(s)
Initializing random number generator from current time

Forcing shutdown in 301 seconds

Initializing worker threads...

Threads started!

[ 5s ] thds: 3 tps: 717.13 qps: 20808.64 (r/w/o: 20808.64/0.00/0.00) lat (ms,95%): 5.18 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 3 tps: 708.82 qps: 20550.25 (r/w/o: 20550.25/0.00/0.00) lat (ms,95%): 5.18 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 3 tps: 673.99 qps: 19550.21 (r/w/o: 19550.21/0.00/0.00) lat (ms,95%): 5.77 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 3 tps: 680.04 qps: 19719.36 (r/w/o: 19719.36/0.00/0.00) lat (ms,95%): 5.47 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 3 tps: 691.56 qps: 20051.15 (r/w/o: 20051.15/0.00/0.00) lat (ms,95%): 5.37 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 3 tps: 685.63 qps: 19891.37 (r/w/o: 19891.37/0.00/0.00) lat (ms,95%): 5.37 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 3 tps: 674.59 qps: 19558.89 (r/w/o: 19558.89/0.00/0.00) lat (ms,95%): 5.57 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 3 tps: 670.40 qps: 19440.36 (r/w/o: 19440.36/0.00/0.00) lat (ms,95%): 5.47 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 3 tps: 661.62 qps: 19187.84 (r/w/o: 19187.84/0.00/0.00) lat (ms,95%): 5.88 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 3 tps: 672.79 qps: 19512.77 (r/w/o: 19512.77/0.00/0.00) lat (ms,95%): 5.47 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 3 tps: 652.38 qps: 18915.94 (r/w/o: 18915.94/0.00/0.00) lat (ms,95%): 5.77 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 3 tps: 658.42 qps: 19096.78 (r/w/o: 19096.78/0.00/0.00) lat (ms,95%): 5.67 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 3 tps: 575.16 qps: 16682.71 (r/w/o: 16682.71/0.00/0.00) lat (ms,95%): 6.55 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 3 tps: 637.65 qps: 18482.31 (r/w/o: 18482.31/0.00/0.00) lat (ms,95%): 6.09 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 3 tps: 656.97 qps: 19054.83 (r/w/o: 19054.83/0.00/0.00) lat (ms,95%): 5.88 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 3 tps: 642.83 qps: 18649.60 (r/w/o: 18649.60/0.00/0.00) lat (ms,95%): 5.99 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 3 tps: 677.36 qps: 19642.58 (r/w/o: 19642.58/0.00/0.00) lat (ms,95%): 5.47 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 3 tps: 679.79 qps: 19708.78 (r/w/o: 19708.78/0.00/0.00) lat (ms,95%): 5.57 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 3 tps: 678.43 qps: 19677.15 (r/w/o: 19677.15/0.00/0.00) lat (ms,95%): 5.57 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 3 tps: 685.62 qps: 19880.14 (r/w/o: 19880.14/0.00/0.00) lat (ms,95%): 5.37 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 3 tps: 657.39 qps: 19062.48 (r/w/o: 19062.48/0.00/0.00) lat (ms,95%): 5.77 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 3 tps: 658.21 qps: 19095.05 (r/w/o: 19095.05/0.00/0.00) lat (ms,95%): 5.77 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 3 tps: 650.37 qps: 18856.82 (r/w/o: 18856.82/0.00/0.00) lat (ms,95%): 5.77 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 3 tps: 626.42 qps: 18171.69 (r/w/o: 18171.69/0.00/0.00) lat (ms,95%): 5.99 err/s: 0.00 reconn/s: 0.00
[ 125s ] thds: 3 tps: 666.18 qps: 19318.91 (r/w/o: 19318.91/0.00/0.00) lat (ms,95%): 5.77 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 3 tps: 677.41 qps: 19635.21 (r/w/o: 19635.21/0.00/0.00) lat (ms,95%): 5.57 err/s: 0.00 reconn/s: 0.00
[ 135s ] thds: 3 tps: 675.36 qps: 19595.47 (r/w/o: 19595.47/0.00/0.00) lat (ms,95%): 5.67 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 3 tps: 659.42 qps: 19121.63 (r/w/o: 19121.63/0.00/0.00) lat (ms,95%): 5.88 err/s: 0.00 reconn/s: 0.00
[ 145s ] thds: 3 tps: 691.42 qps: 20044.34 (r/w/o: 20044.34/0.00/0.00) lat (ms,95%): 5.37 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 3 tps: 657.18 qps: 19063.73 (r/w/o: 19063.73/0.00/0.00) lat (ms,95%): 5.88 err/s: 0.00 reconn/s: 0.00
[ 155s ] thds: 3 tps: 634.62 qps: 18399.28 (r/w/o: 18399.28/0.00/0.00) lat (ms,95%): 6.43 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 3 tps: 605.38 qps: 17551.90 (r/w/o: 17551.90/0.00/0.00) lat (ms,95%): 6.32 err/s: 0.00 reconn/s: 0.00
[ 165s ] thds: 3 tps: 661.42 qps: 19184.48 (r/w/o: 19184.48/0.00/0.00) lat (ms,95%): 5.88 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 3 tps: 614.41 qps: 17824.12 (r/w/o: 17824.12/0.00/0.00) lat (ms,95%): 6.21 err/s: 0.00 reconn/s: 0.00
[ 175s ] thds: 3 tps: 636.00 qps: 18439.04 (r/w/o: 18439.04/0.00/0.00) lat (ms,95%): 6.21 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 3 tps: 673.37 qps: 19533.04 (r/w/o: 19533.04/0.00/0.00) lat (ms,95%): 5.67 err/s: 0.00 reconn/s: 0.00
[ 185s ] thds: 3 tps: 644.43 qps: 18682.27 (r/w/o: 18682.27/0.00/0.00) lat (ms,95%): 5.99 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 3 tps: 688.98 qps: 19983.05 (r/w/o: 19983.05/0.00/0.00) lat (ms,95%): 5.47 err/s: 0.00 reconn/s: 0.00
[ 195s ] thds: 3 tps: 678.03 qps: 19662.01 (r/w/o: 19662.01/0.00/0.00) lat (ms,95%): 5.67 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 3 tps: 675.17 qps: 19577.01 (r/w/o: 19577.01/0.00/0.00) lat (ms,95%): 5.57 err/s: 0.00 reconn/s: 0.00
[ 205s ] thds: 3 tps: 672.83 qps: 19521.55 (r/w/o: 19521.55/0.00/0.00) lat (ms,95%): 5.77 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 3 tps: 688.98 qps: 19974.48 (r/w/o: 19974.48/0.00/0.00) lat (ms,95%): 5.47 err/s: 0.00 reconn/s: 0.00
[ 215s ] thds: 3 tps: 670.00 qps: 19426.52 (r/w/o: 19426.52/0.00/0.00) lat (ms,95%): 5.67 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 3 tps: 654.83 qps: 18990.59 (r/w/o: 18990.59/0.00/0.00) lat (ms,95%): 5.88 err/s: 0.00 reconn/s: 0.00
[ 225s ] thds: 3 tps: 666.97 qps: 19344.75 (r/w/o: 19344.75/0.00/0.00) lat (ms,95%): 5.57 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 3 tps: 651.21 qps: 18883.60 (r/w/o: 18883.60/0.00/0.00) lat (ms,95%): 5.88 err/s: 0.00 reconn/s: 0.00
[ 235s ] thds: 3 tps: 656.80 qps: 19054.65 (r/w/o: 19054.65/0.00/0.00) lat (ms,95%): 5.88 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 3 tps: 643.18 qps: 18644.43 (r/w/o: 18644.43/0.00/0.00) lat (ms,95%): 6.09 err/s: 0.00 reconn/s: 0.00
[ 245s ] thds: 3 tps: 665.20 qps: 19291.06 (r/w/o: 19291.06/0.00/0.00) lat (ms,95%): 5.77 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 3 tps: 617.01 qps: 17895.51 (r/w/o: 17895.51/0.00/0.00) lat (ms,95%): 6.32 err/s: 0.00 reconn/s: 0.00
[ 255s ] thds: 3 tps: 641.98 qps: 18615.63 (r/w/o: 18615.63/0.00/0.00) lat (ms,95%): 5.99 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 3 tps: 623.59 qps: 18084.99 (r/w/o: 18084.99/0.00/0.00) lat (ms,95%): 6.21 err/s: 0.00 reconn/s: 0.00
[ 265s ] thds: 3 tps: 654.65 qps: 18982.01 (r/w/o: 18982.01/0.00/0.00) lat (ms,95%): 5.88 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 3 tps: 626.38 qps: 18169.74 (r/w/o: 18169.74/0.00/0.00) lat (ms,95%): 6.09 err/s: 0.00 reconn/s: 0.00
[ 275s ] thds: 3 tps: 658.17 qps: 19083.52 (r/w/o: 19083.52/0.00/0.00) lat (ms,95%): 5.67 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 3 tps: 637.54 qps: 18488.94 (r/w/o: 18488.94/0.00/0.00) lat (ms,95%): 6.09 err/s: 0.00 reconn/s: 0.00
[ 285s ] thds: 3 tps: 651.30 qps: 18889.30 (r/w/o: 18889.30/0.00/0.00) lat (ms,95%): 5.67 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 3 tps: 644.37 qps: 18687.40 (r/w/o: 18687.40/0.00/0.00) lat (ms,95%): 5.99 err/s: 0.00 reconn/s: 0.00
[ 295s ] thds: 3 tps: 622.01 qps: 18034.88 (r/w/o: 18034.88/0.00/0.00) lat (ms,95%): 6.21 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 3 tps: 651.02 qps: 18885.96 (r/w/o: 18885.96/0.00/0.00) lat (ms,95%): 5.88 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            5729124
        write:                           0
        other:                           0
        total:                           5729124
    transactions:                        197556 (658.50 per sec.)
    queries:                             5729124 (19096.63 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0056s
    total number of events:              197556

Latency (ms):
         min:                                    2.53
         avg:                                    4.55
         max:                                   30.08
         95th percentile:                        5.88
         sum:                               899711.49

Threads fairness:
    events (avg/stddev):           65852.0000/37.16
    execution time (avg/stddev):   299.9038/0.00